arribada/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
	try {
		try {
			m_cmd.read_spimac_state(&spi_st, &mac_st);
		} catch (...) {}
		DEBUG_INFO("SmdSat::bench_parallel_probe: START nb_parallel=%u retx_nb=%u period=%u s | mac=%u spi=%u",
		           nb_parallel, retx_nb, retx_period_s, mac_st, spi_st);

		// BLIND context with the requested nb_parallel — the one byte the
		// production path pins to 1.
		uint8_t ctx[7] = { (uint8_t)retx_nb,
			               (uint8_t)nb_parallel,
			               (uint8_t)(retx_period_s & 0xFF),
			               (uint8_t)((retx_period_s >> 8) & 0xFF),
			               (uint8_t)((retx_period_s >> 16) & 0xFF),
			               (uint8_t)((retx_period_s >> 24) & 0xFF),
			               0 };
		try {
			m_cmd.load_kmac_profil(2, ctx, sizeof(ctx));
			nrf_delay_ms(smdsat_delay_load_kmac_ms());
			DEBUG_INFO("SmdSat::bench_parallel_probe: BLIND ctx loaded (nb_parallel=%u)", nb_parallel);
		} catch (...) {
			snprintf(out, out_len, "%%TXPAR ERR kmac-load-refused nb_parallel=%u", nb_parallel);
			if (was_stopped) {
				m_cmd.deinit();
				shutdown();
				GPIOPins::release_sensors_pwr();
				nrf_gpio_cfg_default(BSP::GPIO_Inits[SAT_RESET].pin_number);
			}
			return;
		}

		// Fire nb_parallel payloads back to back, no waiting. Each is a distinct
		// 12-byte SHORT-sized frame so the module cannot dedupe them.
		for (unsigned int i = 0; i < nb_parallel; i++) {
			KineisPacket payload(12, (char)0x00);
			payload[0] = (char)0xB0;
			payload[1] = (char)i;
			uint8_t mac_before = 0, spi_before = 0;
			try {
				m_cmd.read_spimac_state(&spi_before, &mac_before);
			} catch (...) {}

			// Wait for the SPI slave to service the bus again before pushing.
			// The module ACKs WRITE_TX immediately then does TCXO warmup and the
			// MAC queueing asynchronously, and during that window it simply does
			// not drive MISO -- reads come back all-0xAA. The first campaign read
			// those as a refusal; they are a busy bus. bMGR_SPI_CMD_WRITETX_cmd
			// refuses only on ERROR_DATA_QUEUE_FULL, so a push that gets through
			// is queued, up to USERDATA_TX_FIFO_SIZE = 4.
			if (i > 0) {
				for (unsigned int w = 0; w < 40; w++) {
					uint8_t sp = 0, mc = 0;
					bool answered = false;
					try {
						m_cmd.read_spimac_state(&sp, &mc);
						answered = true;
					} catch (...) {}
					if (answered && mc != 0) break;
					nrf_delay_ms(500);
					PMU::kick_watchdog();
				}
			}
			const uint64_t t0 = PMU::get_timestamp_ms();
			if (!t_first) t_first = t0;
			bool ok = false;
			bool exception = false;
			for (unsigned int attempt = 0; attempt < 3 && !ok; attempt++) {
				try {
					ok = m_cmd.initiate_tx(payload);
				} catch (...) {
					exception = true;
				}
				if (!ok) {
					nrf_delay_ms(750);
					PMU::kick_watchdog();
				}
			}
			if (ok) exception = false;
			const uint64_t dt = PMU::get_timestamp_ms() - t_first;

			uint8_t mac_after = 0, spi_after = 0;
			try {
				m_cmd.read_spimac_state(&spi_after, &mac_after);
			} catch (...) {}

			if (exception)
				threw++;
			else if (ok)
				accepted++;
			else
				refused++;

			DEBUG_INFO("SmdSat::bench_parallel_probe: msg %u/%u t+%u ms -> %s | mac %u->%u spi %u->%u", i + 1,
			           nb_parallel, (unsigned int)dt,
			           exception ? "THREW" : (ok ? "ACCEPTED" : "REFUSED"), mac_before, mac_after, spi_before,
			           spi_after);
			PMU::kick_watchdog();
		}

		try {
			m_cmd.read_spimac_state(&spi_st, &mac_st);
		} catch (...) {}
		snprintf(out, out_len, "%%TXPAR n=%u accepted=%u refused=%u threw=%u mac_end=%u spi_end=%u", nb_parallel,
		         accepted, refused, threw, mac_st, spi_st);
		DEBUG_INFO("SmdSat::bench_parallel_probe: DONE %s", out);
	} catch (...) {
		snprintf(out, out_len, "%%TXPAR ERR exception accepted=%u refused=%u threw=%u", accepted, refused, threw);
	}

	// Deliberately NOT tearing the module down when it was already running: a
	// burst is now in flight and cutting power mid-burst is a different
	// experiment. Only restore what we powered up ourselves.
	if (was_stopped) {
		DEBUG_INFO("SmdSat::bench_parallel_probe: module was stopped — leaving it powered for the burst");
	}
}
#endif

void SmdSat::read_credentials(unsigned int *dec_id, unsigned int *address, std::string *seckey,
                              std::string *radioconf) {
	DEBUG_TRACE("SmdSat::%s", __func__);
	bool was_stopped = (m_state == SmdSatState::stopped);

	if (was_stopped) {
		power_on_blocking();
	}

	PMU::kick_watchdog();
	nrf_delay_ms(smdsat_delay_power_on_ms());

	// Write pending credentials to SMD before reading them back.
	// PARMW saves credentials to the nRF config store but does NOT push
	// them to the SMD. Without this, SATVF reads stale/empty flash.
	if (configuration_store && configuration_store->is_credentials_dirty()) {
		DEBUG_INFO("SmdSat::%s: credentials dirty — writing to SMD before verify", __func__);
		if (write_credentials_from_config()) {
			configuration_store->clear_credentials_dirty();
			// KMAC reload so the MAC picks up the new RCONF
			try {
				m_cmd.load_kmac_profil(1);
				nrf_delay_ms(smdsat_delay_load_kmac_ms());
			} catch (...) {
				DEBUG_WARN("SmdSat::%s: KMAC reload failed after credential write", __func__);
			}
		} else {
			DEBUG_ERROR("SmdSat::%s: credential write failed before verify", __func__);
		}
	}

	try {
		if (dec_id) {
			uint32_t dec_id_val = 0;
			m_cmd.read_id(&dec_id_val);
			*dec_id = static_cast<unsigned int>(dec_id_val);
			nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
		}

		if (address) {
			uint8_t address_data[SMDSAT_CMD_READ_ADDR_LEN] = { 0 };
			smd_uint8_array_t address_value = { SMDSAT_CMD_READ_ADDR_LEN, address_data };
			m_cmd.read_address(&address_value);
			nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
			*address = (static_cast<uint32_t>(address_value.p_data[0]) << 24)
			           | (static_cast<uint32_t>(address_value.p_data[1]) << 16)
			           | (static_cast<uint32_t>(address_value.p_data[2]) << 8) | (address_value.p_data[3]);
		}

		if (seckey) {
			uint8_t seckey_data[SMDSAT_CMD_READ_SECKEY_LEN] = { 0 };
			smd_uint8_array_t seckey_value = { SMDSAT_CMD_READ_SECKEY_LEN, seckey_data };
			m_cmd.read_seckey(&seckey_value);
			nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
			*seckey = Binascii::hexlify(std::string(reinterpret_cast<char *>(seckey_data), SMDSAT_CMD_READ_SECKEY_LEN));
		}

		if (radioconf) {
			uint8_t rconf_raw[SMDSAT_CMD_READ_RCONF_RAW_LEN] = { 0 };
			uint16_t rconf_raw_len = 0;
			m_cmd.read_rconf_raw(rconf_raw, &rconf_raw_len);
			nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
			*radioconf =
			    Binascii::hexlify(std::string(reinterpret_cast<char *>(rconf_raw),
				                              rconf_raw_len > 0 ? rconf_raw_len : SMDSAT_CMD_READ_RCONF_RAW_LEN));
			DEBUG_INFO("SmdSat::%s: RCONF_RAW: %s", __func__, radioconf->c_str());
		}
	} catch (...) {
		DEBUG_ERROR("SmdSat::%s: error during credential read", __func__);
		if (was_stopped) {
			m_cmd.deinit();
			shutdown();
			GPIOPins::release_sensors_pwr();
			nrf_gpio_cfg_default(BSP::GPIO_Inits[SAT_RESET].pin_number);
		}
		throw;
	}

	if (was_stopped) {
		m_cmd.deinit();
		shutdown();
		GPIOPins::release_sensors_pwr();
		nrf_gpio_cfg_default(BSP::GPIO_Inits[SAT_RESET].pin_number);
	}
}

// ============================================================================
// Runtime modulation switching
// ============================================================================

bool SmdSat::switch_modulation(KineisModulation mode, const std::string &rconf_hex) {
	// modswitch_t0/elapsed used only by MODSWITCH_LOG (currently no-op) — keep
	// the anchor in place so re-enabling the macro requires no other edits.
	[[maybe_unused]] uint64_t modswitch_t0 = PMU::get_timestamp_ms();
	[[maybe_unused]] auto modswitch_elapsed = [&]() -> unsigned {
		return static_cast<unsigned>(PMU::get_timestamp_ms() - modswitch_t0);
	};
	SmdArgosModulation target = kineis_to_smd_mod(mode);
	if (target == m_modulation) {
		MODSWITCH_LOG(0, "already in target modulation %d — no-op", static_cast<int>(target));
		return true;
	}

	MODSWITCH_LOG(0, "switching %d -> %d (state=%d)", static_cast<int>(m_modulation), static_cast<int>(target),
	              static_cast<int>(m_state));

