arribada/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
	if (rconf_hex.size() != 32) {
		DEBUG_ERROR("SmdSat::%s: invalid RCONF hex length %u (expected 32)", __func__,
		            static_cast<unsigned>(rconf_hex.size()));
		return false;
	}

	// If SMD is stopped, defer the switch — RCONF will be written on next power-on
	if (m_state == SmdSatState::stopped) {
		MODSWITCH_LOG(modswitch_elapsed(), "SMD stopped, DEFERRED switch to %d (no SPI)", static_cast<int>(target));
		m_modulation = target;
		m_pending_rconf = rconf_hex;
		// Persist so the next boot loads this modulation directly.
		if (configuration_store) {
			configuration_store->write_param(ParamID::ARGOS_CACHED_MODULATION, static_cast<unsigned int>(m_modulation));
		}
		// Force state_load_kmac on next boot so the deferred RCONF gets applied.
		// Without this, idle_pending skips to idle and the RCONF is never written.
		is_kmac_profil_loaded = false;
		m_kmac_pushed_this_session = false;
		return true;
	}

	// Timing: set_radio_conf is a 2-phase write (~30ms SPI) but the STM32 needs
	// time to process it. save_radio_conf triggers a flash persistence (~100ms).
	// load_kmac_profil needs the MAC to re-initialize with the new RCONF.
	// Old timing (60ms everywhere) caused TX REQ failures because the MAC was
	// not ready after KMAC reload. Increase progressively:
	// - After RCONF write: 80ms (STM32 processes + small margin)
	// - After RCONF save: 120ms (flash write ~100ms + margin)
	// - After KMAC load:  200ms (MAC re-init, less than clean-repo's 1000ms)

	// 1. Write RCONF
	std::string rconf_bin = Binascii::unhexlify(rconf_hex);
	smd_uint8_array_t rconf_struct = { static_cast<uint16_t>(rconf_bin.size()),
	                                   reinterpret_cast<uint8_t *>(rconf_bin.data()) };
	try {
		m_cmd.set_radio_conf(&rconf_struct);
	} catch (...) {
		DEBUG_ERROR("SmdSat::%s: failed to write RCONF", __func__);
		return false;
	}
	MODSWITCH_LOG(modswitch_elapsed(), "set_radio_conf OK, waiting 80ms");

	nrf_delay_ms(80);  // STM32 RCONF processing

	// 2. Save RCONF to flash
	try {
		if (!m_cmd.save_radio_conf()) {
			DEBUG_ERROR("SmdSat::%s: failed to save RCONF", __func__);
			return false;
		}
	} catch (...) {
		DEBUG_ERROR("SmdSat::%s: save_radio_conf exception", __func__);
		return false;
	}
	MODSWITCH_LOG(modswitch_elapsed(), "save_radio_conf OK (flash), waiting 120ms");

	nrf_delay_ms(120);  // Flash persistence (~100ms) + margin

	// 3. Reload KMAC profile 1
	try {
		m_cmd.load_kmac_profil(1);
	} catch (...) {
		DEBUG_ERROR("SmdSat::%s: failed to reload KMAC", __func__);
		return false;
	}
	MODSWITCH_LOG(modswitch_elapsed(), "load_kmac_profil(1) OK, waiting 200ms");

	nrf_delay_ms(200);  // MAC re-init after KMAC reload

	// Update cached modulation
	m_modulation = target;
	is_kmac_profil_loaded = true;
	// Persist so the next boot loads this modulation directly.
	if (configuration_store) {
		configuration_store->write_param(ParamID::ARGOS_CACHED_MODULATION, static_cast<unsigned int>(m_modulation));
	}

	MODSWITCH_LOG(modswitch_elapsed(), "modulation switched to %d OK — TOTAL", static_cast<int>(target));
	return true;
}

KineisModulation SmdSat::get_current_modulation() const {
	return smd_to_kineis_mod(m_modulation);
}

// ============================================================================
// DFU (delegates to command layer)
// ============================================================================

bool SmdSat::dfu_enter() {
	DEBUG_TRACE("SmdSat::%s", __func__);

	bool was_stopped = (m_state == SmdSatState::stopped);

	if (was_stopped) {
		GPIOPins::acquire_sensors_pwr();
		GPIOPins::set(SAT_PWR_EN);
		PMU::kick_watchdog();
		nrf_delay_ms(smdsat_delay_power_on_ms());
		PMU::kick_watchdog();
		nrf_delay_ms(smdsat_delay_power_on_ms());
#ifdef SMD_VPA_PIN
		GPIOPins::release_to_highz(SMD_VPA_PIN);
#endif

		// Only init SPI if it wasn't already running
		m_cmd.init();
	}
	// If SPI is already active (not stopped), do NOT re-init — dfu_enter() handles protocol reset

	PMU::kick_watchdog();
	nrf_delay_ms(smdsat_delay_power_on_ms() / 2);

	bool result = m_cmd.dfu_enter();

	if (!result) {
		if (was_stopped) {
			m_cmd.deinit();
			shutdown();
			GPIOPins::release_sensors_pwr();
			nrf_gpio_cfg_default(BSP::GPIO_Inits[SAT_RESET].pin_number);
		}
	}

	return result;
}

bool SmdSat::dfu_exit() {
	return m_cmd.dfu_exit();
}

bool SmdSat::dfu_get_bootloader_info(SmdDfuInfo *info) {
	return m_cmd.dfu_get_bootloader_info(info);
}

SmdDfuResponse SmdSat::firmware_update(const uint8_t *firmware, size_t size,
                                       void (*progress_callback)(uint8_t percent)) {
	DEBUG_INFO("SmdSat::%s: Starting firmware update | size=%u bytes", __func__, static_cast<unsigned>(size));

	if (firmware == nullptr || size == 0) {
		DEBUG_ERROR("SmdSat::%s: Invalid firmware data", __func__);
		return DFU_RSP_ERROR;
	}

	SmdDfuResponse result;

	if (!m_cmd.dfu_supported()) {
		DEBUG_ERROR("SmdSat::%s: DFU not supported by command layer", __func__);
		return DFU_RSP_ERROR;
	}

	// DFU failure cleanup: exit DFU mode so SMD returns to normal operation
	auto dfu_fail = [this](SmdDfuResponse r) -> SmdDfuResponse {
		m_cmd.dfu_exit();
		return r;
	};

	// Enter DFU mode
	if (!dfu_enter()) {
		DEBUG_ERROR("SmdSat::%s: Failed to enter DFU mode", __func__);
		return DFU_RSP_NOT_READY;
	}

	if (progress_callback) progress_callback(5);

	// Get bootloader info
	SmdDfuInfo dfu_info;
	if (!m_cmd.dfu_get_bootloader_info(&dfu_info)) {
		DEBUG_ERROR("SmdSat::%s: Failed to get bootloader info", __func__);
		return dfu_fail(DFU_RSP_ERROR);
	}

	if (size > dfu_info.app_max_size) {
		DEBUG_ERROR("SmdSat::%s: Firmware too large (%u > %u)", __func__, static_cast<unsigned>(size),
		            dfu_info.app_max_size);
		return dfu_fail(DFU_RSP_SIZE_ERROR);
	}

	if (progress_callback) progress_callback(15);

	// Erase
	result = m_cmd.dfu_erase();
	if (result != DFU_RSP_OK) {
		DEBUG_ERROR("SmdSat::%s: Flash erase failed", __func__);
		return dfu_fail(result);
	}

	if (progress_callback) progress_callback(25);

